wisteria-1c/Конфигурация/Catalogs/ОфлайнОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОфлайнОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбработчикОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWebСервисОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключенияОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключенияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОфлайнОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаОфлайнОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/CommonModules/ИнтеграцияПодсистемБПО/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Библиотека подключаемого оборудования".
// ОбщийМодуль.ИнтеграцияПодсистемБПО.
//
// Серверные процедуры и функции интеграции с БСП:
//  - Подписка на события БСП;
//  - Обработка событий БСП;
//  - Определение списка возможных подписок в БСП;
//  - Вызов методов БСП, на которые выполнена подписка.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Определяет события, на которые подписана эта библиотека.
//
// Параметры:
//  Подписки - Структура
//
Процедура ПриОпределенииПодписокНаСобытияБСП(Подписки) Экспорт
	
	// БазоваяФункциональность
	Подписки.ПриДобавленииПодсистем = Истина;
	Подписки.ПриДобавленииПараметровРаботыКлиентаПриЗапуске = Истина;
	Подписки.ПриДобавленииОбработчиковУстановкиПараметровСеанса = Истина;
	
	// ВнешниеКомпоненты
	Подписки.ПриОпределенииИспользуемыхВнешнихКомпонент = Истина;
	
	// РегламентныеЗадания
	Подписки.ПриОпределенииНастроекРегламентныхЗаданий = Истина;
	
	
КонецПроцедуры

// См. ИнтеграцияПодсистемБСП.ПриОпределенииИспользуемыхВнешнихКомпонент.
//
Процедура ПриОпределенииИспользуемыхВнешнихКомпонент(Компоненты) Экспорт
	
	МенеджерОборудования.ЗаполнитьИспользуемыеВнешниеКомпоненты(Компоненты);
	
КонецПроцедуры

#Область БазоваяФункциональность

// См. ПодсистемыКонфигурацииПереопределяемый.ПриДобавленииПодсистем.
//
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБПО");
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиентаПриЗапуске.
//
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	Если ОбщегоНазначенияБПО.РазделениеВключено() 
		И Не ОбщегоНазначенияБПО.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияБПО.ИспользуетсяБСП() Тогда
		Параметры.Вставить("ИменаПодсистем", ОбщегоНазначенияБПОПовтИсп.ИменаПодсистем());
		Если Параметры.Свойство("ТекущаяДатаНаКлиенте") Тогда
			ДатаСеанса = ТекущаяДатаСеанса();
			Параметры.Вставить("ПоправкаКВремениСеанса", ДатаСеанса - Параметры.ТекущаяДатаНаКлиенте);
		Иначе
			Параметры.Вставить("ПоправкаКВремениСеанса", 0);
		КонецЕсли;
	КонецЕсли;
	
	ИдентификаторОбсужденияРаспределеннойФискализации = Неопределено;
	
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		ИдентификаторОбсужденияРаспределеннойФискализации = МодульРаспределеннаяФискализация.ПодключениеСистемыВзаимодействия();
	КонецЕсли;
	
	ВерсияБСП = ОбщегоНазначенияБПО.ВерсияБСП();
	ПараметрыБПО = Новый Структура;
	Параметры.Вставить("ПараметрыБПО", ПараметрыБПО);
	ПараметрыБПО.Вставить("ВерсияБСП", ВерсияБСП);
	ПараметрыБПО.Вставить("ВерсияБиблиотеки", МенеджерОборудования.ВерсияБиблиотеки());
	ПараметрыБПО.Вставить("ИдентификаторОбсужденияРаспределеннойФискализации", ИдентификаторОбсужденияРаспределеннойФискализации);
	ПараметрыБПО.Вставить("СоответствиеТиповОборудования", МенеджерОборудования.СоответствиеТиповОборудования());
	ПараметрыБПО.Вставить("ДоступныеТипыОборудования", МенеджерОборудования.ДоступныеТипыОборудования(Истина));
	Параметры.Вставить("УведомленияКлиентаДоступно", ОбщегоНазначенияБПО.УведомленияКлиентаДоступно());
	
	Если ОбщегоНазначенияБПО.ИспользуетсяУстройстваВвода() Тогда
		МодульОборудованиеУстройстваВвода = ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеУстройстваВвода");
		ПараметрыОчередиСобытийСканера = МодульОборудованиеУстройстваВвода.ПараметрыОчередиСобытийСканера();
		ПараметрыБПО.Вставить("ИспользуетсяОчередьСобытийСканера", ПараметрыОчередиСобытийСканера.Используется);
		ПараметрыБПО.Вставить("ТаймаутОбработкиСобытияСканера", ПараметрыОчередиСобытийСканера.Таймаут);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента; // требуется прямое обращение к параметру сеанса
	ПараметрыРабочегоМеста = МенеджерОборудования.ПараметрыРабочегоМестаПриЗапуске(РабочееМесто);
	ПараметрыБПО.Вставить("ПараметрыРабочегоМеста", ПараметрыРабочегоМеста);
	Параметры.Вставить("ЕстьПодключаемоеОборудованиеНаРабочемМесте", 
		МенеджерОборудования.ЕстьПодключаемоеОборудованиеНаРабочемМесте(РабочееМесто));
	
	// ++ НеМобильноеПриложение
	Если ОбщегоНазначенияБПО.ДоступноИспользованиеРазделенныхДанных() Тогда
		ПараметрыРабочегоМеста.ИспользуетсяRDP = МенеджерОборудования.ИспользуетсяПротоколRDP();
	КонецЕсли;
	// -- НеМобильноеПриложение
	
	ОборудованиеДляПереустановки = МенеджерОборудования.МакетыДляПереустановкиДрайверов(РабочееМесто);
	ПараметрыБПО.Вставить("ОборудованиеДляПереустановки", ОборудованиеДляПереустановки);
	
	ПараметрыБПО.Вставить("ПараметрыЛогированияОперацийСОборудованием", Неопределено);
	Если ОбщегоНазначенияБПО.ИспользуетсяПодсистемаЛогирования() Тогда
		МодульЛогированиеОперацийБПО = ОбщегоНазначенияБПО.ОбщийМодуль("ЛогированиеОперацийБПО");
		ПараметрыЛогирования = МодульЛогированиеОперацийБПО.ПараметрыЛогированияОперацийСОборудованием();
		ПараметрыБПО.ПараметрыЛогированияОперацийСОборудованием = ПараметрыЛогирования;
	КонецЕсли;
	
	ПараметрыБПО.Вставить("КлассификаторыБиблиотеки", МенеджерОборудования.КлассификаторыБиблиотеки());
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиента.
//
Процедура ПриДобавленииПараметровРаботыКлиента(Параметры) Экспорт
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПереименованийОбъектовМетаданных.
//
Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
//
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("РабочееМестоКлиента", 
		"МенеджерОборудованияВызовСервера.УстановитьПараметрыСеансаПодключаемогоОборудования");
	
КонецПроцедуры                      

// Вызов этой процедуры необходимо разместить в модуле сеанса в процедуре УстановкаПараметровСеанса
// согласно документации.
//
// Параметры:
//  ИменаПараметровСеанса - Массив - устанавливаемые идентификаторы параметров сеанса
//
Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса) Экспорт
	
	Если ИменаПараметровСеанса <> Неопределено Тогда
		
		Для Каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
			Если ИмяПараметра = "РабочееМестоКлиента" Тогда
				МенеджерОборудованияВызовСервера.УстановитьПараметрыСеансаПодключаемогоОборудования(ИмяПараметра, Неопределено);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызов этой процедуры необходимо выполнить после обновления БПО, если не используется БСП
Процедура ОбновлениеИнформационнойБазыБПО() Экспорт
	
	// ++ Локализация
	РегистрыСведений.ЗначенияЕМРЦ.ЗаполнитьЗначенияРегистраЕМРЦ();
	// -- Локализация
	МенеджерОборудования.ОбновитьПоставляемыеДрайвера(); 
	МенеджерОборудования.ОбновитьУстановленныеДрайвера();
	
	ОбновлениеИнформационнойБазыБПО.ОбновитьШаблоныЭтикетокИЦенников();
	ОбновлениеИнформационнойБазыБПО.ОбновитьПараметрыРегистрацииОборудования();
	ОбновлениеИнформационнойБазыБПО.УстановитьСрокХраненияОпераций();
	
	// ++ Локализация
	// ++ НеМобильноеПриложение
	Справочники.ОфлайнОборудование.УстановитьВерсиюФорматаОбменаККМED();
	// -- НеМобильноеПриложение
	// -- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

// Вызывается из процедуры РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
// для установки доступности регламентного задания, определяет зависимость от функциональных опций.
// 
// Параметры:
//  Настройки - ТаблицаЗначений
//  ФункциональнаяОпция - ОбъектМетаданныхФункциональнаяОпция
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки, ФункциональнаяОпция = Неопределено) Экспорт
	
	// ++ НеМобильноеПриложение
	Если ОбщегоНазначенияБПО.ИспользуетсяПлатежныеСистемы() Тогда
		МодульОборудованиеПлатежныеСистемы = ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеПлатежныеСистемы");
		МодульОборудованиеПлатежныеСистемы.ПриОпределенииНастроекРегламентныхЗаданий(Настройки, ФункциональнаяОпция);
	КонецЕсли;
	
	Если ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодульОборудованиеЧекопечатающиеУстройства = ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройства");
		МодульОборудованиеЧекопечатающиеУстройства.ПриОпределенииНастроекРегламентныхЗаданий(Настройки, ФункциональнаяОпция);
		Если ОбщегоНазначенияБПО.ИспользуетсяМаркировка() Тогда
			МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
			МодульМенеджерОборудованияМаркировка.ПриОпределенииНастроекРегламентныхЗаданий(Настройки, ФункциональнаяОпция);
		КонецЕсли;
	КонецЕсли;

	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		МодульРаспределеннаяФискализация.ПриОпределенииНастроекРегламентныхЗаданий(Настройки, ФункциональнаяОпция);
	КонецЕсли;

	Если ОбщегоНазначенияБПО.ИспользуетсяРассылкаЭлектронныхЧеков() Тогда
		МодульРассылкаЭлектронныхЧеков = ОбщегоНазначенияБПО.ОбщийМодуль("РассылкаЭлектронныхЧеков");
		МодульРассылкаЭлектронныхЧеков.ПриОпределенииНастроекРегламентныхЗаданий(Настройки, ФункциональнаяОпция);
	КонецЕсли;
	
	Если ОбщегоНазначенияБПО.ИспользуетсяПодсистемаЛогирования() Тогда
		МодульЛогированиеОперацийБПО = ОбщегоНазначенияБПО.ОбщийМодуль("ЛогированиеОперацийБПО");
		МодульЛогированиеОперацийБПО.ПриОпределенииНастроекРегламентныхЗаданий(Настройки, ФункциональнаяОпция);
	КонецЕсли;
	// -- НеМобильноеПриложение
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗаданияТехнологияСервиса

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт
	
	// ++ НеМобильноеПриложение
	Если ОбщегоНазначенияБПО.ИспользуетсяПлатежныеСистемы() Тогда
		ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ОчисткаИсторииПлатежныхОпераций.Имя);
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
		ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ОчисткаИсторииФискальныхОпераций.Имя);
		Если ОбщегоНазначенияБПО.ИспользуетсяМаркировка() Тогда
			МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
			МодульМенеджерОборудованияМаркировка.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		МодульРаспределеннаяФискализация.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяРассылкаЭлектронныхЧеков() Тогда
		МодульРассылкаЭлектронныхЧеков = ОбщегоНазначенияБПО.ОбщийМодуль("РассылкаЭлектронныхЧеков");
		МодульРассылкаЭлектронныхЧеков.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	КонецЕсли;
	
	Если ОбщегоНазначенияБПО.ИспользуетсяПодсистемаЛогирования() Тогда
		МодульЛогированиеОперацийБПО = ОбщегоНазначенияБПО.ОбщийМодуль("ЛогированиеОперацийБПО");
		МодульЛогированиеОперацийБПО.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	КонецЕсли;
	
	// -- НеМобильноеПриложение
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	// ++ НеМобильноеПриложение
	Если ОбщегоНазначенияБПО.ИспользуетсяПлатежныеСистемы() Тогда
		СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОчисткаИсторииПлатежныхОпераций.ИмяМетода);
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
		СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОчисткаИсторииФискальныхОпераций.ИмяМетода);
		Если ОбщегоНазначенияБПО.ИспользуетсяМаркировка() Тогда
			МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
			МодульМенеджерОборудованияМаркировка.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		МодульРаспределеннаяФискализация.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяРассылкаЭлектронныхЧеков() Тогда
		МодульРассылкаЭлектронныхЧеков = ОбщегоНазначенияБПО.ОбщийМодуль("РассылкаЭлектронныхЧеков");
		МодульРассылкаЭлектронныхЧеков.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяПодсистемаЛогирования() Тогда
		МодульЛогированиеОперацийБПО = ОбщегоНазначенияБПО.ОбщийМодуль("ЛогированиеОперацийБПО");
		МодульЛогированиеОперацийБПО.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;
	// -- НеМобильноеПриложение
	
КонецПроцедуры

#КонецОбласти

#Область СерверныеОповещения

// см. ОбщегоНазначенияПереопределяемый.ПриДобавленииСерверныхОповещений
Процедура ПриДобавленииСерверныхОповещений(Оповещения) Экспорт
	
	Если ОбщегоНазначенияБПО.РазделениеВключено() 
		И Не ОбщегоНазначенияБПО.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	МодульСерверныеОповещения = ОбщегоНазначенияБПО.ОбщийМодуль("СерверныеОповещения");
	РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	Если МенеджерОборудования.ЕстьПодключаемоеОборудованиеНаРабочемМесте(РабочееМесто) Тогда
		
		ИмяОповещения = МенеджерОборудованияКлиентСервер.КлючЗапросаАрхиваЛоговДрайвера();
		Оповещение = МодульСерверныеОповещения.НовоеСерверноеОповещение(ИмяОповещения);
		Оповещение.ИмяМодуляПолучения = "ИнтеграцияПодсистемБПОКлиент";
		Оповещение.ПериодПроверки = 60;
		Оповещения.Вставить(Оповещение.Имя, Оповещение);
	
	КонецЕсли;
	
	ИмяОповещения = МенеджерОборудованияКлиентСервер.КлючОтветаНаЗапросАрхиваЛоговДрайвера();
	Оповещение = МодульСерверныеОповещения.НовоеСерверноеОповещение(ИмяОповещения);
	Оповещение.ИмяМодуляПолучения = "ИнтеграцияПодсистемБПОКлиент";
	Оповещение.ПериодПроверки = 60;
	Оповещения.Вставить(Оповещение.Имя, Оповещение);
	
	
КонецПроцедуры

#КонецОбласти

#Область КонтактнаяИнформация

Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Если МенеджерОборудования.ИспользуетсяКонтактнаяИнформацияБСП() Тогда
	
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенногоВида = "СправочникПодключаемоеОборудование";
		Элемент.ЭтоГруппа = Истина;
		Элемент.Наименование = НСтр("ru = 'Контактная информация справочника ""Подключаемое оборудование""'");
		Элемент.Используется = Истина;
	
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенногоВида = "ПодключаемоеОборудованиеТелефонТехподдержки";
		Элемент.Используется = Истина;
		Элемент.Родитель = "СправочникПодключаемоеОборудование";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		Элемент.РеквизитДопУпорядочивания = 1;
		Элемент.МожноИзменятьСпособРедактирования = Истина;
		Элемент.ВидРедактирования = "ПолеВводаИДиалог";
		Элемент.ОбязательноеЗаполнение = Ложь;
		Элемент.РазрешитьВводНесколькихЗначений = Истина;
		Элемент.ЗапретитьРедактированиеПользователем = Ложь;
		Элемент.ТелефонСДобавочнымНомером = Истина;
		Элемент.ОтображатьВсегда = Истина;
		Элемент.Наименование = НСтр("ru = 'Телефон'");
	
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенногоВида = "ПодключаемоеОборудованиеЭлектроннаяПочтаТехподдержки";
		Элемент.Используется = Истина;
		Элемент.Родитель = "СправочникПодключаемоеОборудование";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		Элемент.РеквизитДопУпорядочивания = 2;
		Элемент.МожноИзменятьСпособРедактирования = Истина;
		Элемент.ВидРедактирования = "ПолеВвода";
		Элемент.ОбязательноеЗаполнение = Ложь;
		Элемент.РазрешитьВводНесколькихЗначений = Истина;
		Элемент.ЗапретитьРедактированиеПользователем = Ложь;
		Элемент.ПроверятьКорректность = Истина;
		Элемент.ОтображатьВсегда = Истина;
		Элемент.Наименование = НСтр("ru = 'E-mail'");
	
		Элемент = Элементы.Добавить(); 
		Элемент.ИмяПредопределенногоВида = "ПодключаемоеОборудованиеАдресТехподдержки";
		Элемент.Используется = Истина;
		Элемент.Родитель = "СправочникПодключаемоеОборудование";
		Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		Элемент.РеквизитДопУпорядочивания = 9;
		Элемент.МожноИзменятьСпособРедактирования = Истина;
		Элемент.ВидРедактирования = "ПолеВводаИДиалог";
		Элемент.ОбязательноеЗаполнение = Ложь;
		Элемент.РазрешитьВводНесколькихЗначений = Ложь;
		Элемент.ЗапретитьРедактированиеПользователем = Ложь;
		Элемент.ТолькоНациональныйАдрес = Ложь;
		Элемент.ПроверятьКорректность = Ложь;
		Элемент.СкрыватьНеактуальныеАдреса = Ложь;
		Элемент.ВключатьСтрануВПредставление = Ложь;
		Элемент.Наименование = НСтр("ru = 'Адрес'");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
